
## Plan Result




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * azurerm_key_vault_secret.app_insights_key
  * azurerm_resource_group.rg
  * module.sscs-bulk-scan-vault.azurerm_key_vault.kv
  * module.sscs-bulk-scan-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-bulk-scan-aat/providers/Microsoft.KeyVault/vaults/sscs-bulk-scan-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://sscs-bulk-scan-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/85eed823417846cc9a75a8175f96fa46"
        name                    = "AppInsightsInstrumentationKey"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git" -> null
            "application"         = "social-service-child-support"
          + "builtFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
            "source"              = "App Insights sscs-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-bulk-scan-aat"
        name     = "sscs-bulk-scan-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git" -> null
            "application"         = "social-service-child-support"
          + "builtFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.sscs-bulk-scan-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-bulk-scan-aat/providers/Microsoft.KeyVault/vaults/sscs-bulk-scan-aat"
        name                            = "sscs-bulk-scan-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git" -> null
            "application"         = "social-service-child-support"
          + "builtFrom"           = "https://github.com/HMCTS/sscs-bulk-scan.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (13 unchanged attributes hidden)

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.sscs-bulk-scan-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-bulk-scan-aat/providers/Microsoft.KeyVault/vaults/sscs-bulk-scan-aat|sscs-bulk-scan-aat"
        name                       = "sscs-bulk-scan-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1449,"Program":"tfcmt","SHA1":"","Vars":{}} -->